{
  "architectures": [
    "DFlashDraftModel"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoModel": "dflash.DFlashDraftModel"
  },
  "block_size": 16,
  "bos_token_id": 151643,
  "dflash_config": {
    "causal_head": true,
    "mask_token_id": 248070,
    "target_layer_ids": [
      1,
      10,
      19,
      28,
      37
    ]
  },
  "dtype": "bfloat16",
  "eos_token_id": 248046,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 6144,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 262144,
  "max_window_layers": 8,
  "model_type": "qwen3",
  "num_attention_heads": 32,
  "num_hidden_layers": 8,
  "num_key_value_heads": 4,
  "num_target_layers": 40,
  "pad_token_id": null,
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "rope_theta": 10000000,
    "rope_type": "default"
  },
  "sliding_window": null,
  "tie_word_embeddings": false,
  "transformers_version": "5.9.0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 248320
}
